### LabelEncoder
* sklearn.preprocessing.LabelEncoder
* fit(y) 
* fit_transform(y)

Fit label encoder and return encoded labels.

* get_params([deep])

Get parameters for this estimator.

* inverse_transform(y)

Transform labels back to original encoding.

* set_params(**params)

Set the parameters of this estimator.

* transform(y)

Transform labels to normalized encoding.

In [2]:
from sklearn.preprocessing import LabelEncoder
items = ['TV', '냉장고', '전자렌지', '컴퓨터', '선풍기', '선풍기', '믹서', '믹서']
# LabelEncoder를 객체로 생성한 후, fit()과 transform()으로 label 인코딩 수행
encoder = LabelEncoder()
encoder.fit(items)
labels = encoder.transform(items)
print('인코딩 변환값: ', labels)

인코딩 변환값:  [0 1 4 5 3 3 2 2]

In [3]:
print('인코딩 클래스: ', encoder.classes_)
print('디코딩 원본 값: ', encoder.inverse_transform([4,5,2,0,1,1,3,3]))

인코딩 클래스:  ['TV' '냉장고' '믹서' '선풍기' '전자렌지' '컴퓨터']
디코딩 원본 값:  ['전자렌지' '컴퓨터' '믹서' 'TV' '냉장고' '냉장고' '선풍기' '선풍기']

### titanic_train.csv 전처리

In [5]:
import pandas as pd

df = pd.read_csv('C:/apps/ml/datasets/titanic_train.csv')

In [6]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.drop(columns = ['PassengerId','Pclass','Name','SibSp', 'Parch','Ticket','Fare','Cabin'],inplace=True)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       714 non-null    float64
 3   Embarked  889 non-null    object
dtypes: float64(1), int64(1), object(2)
memory usage: 28.0+ KB

In [11]:
df['Age'].isnull().sum()

177

In [15]:
df['Age']  = df['Age'].fillna(df['Age'].mean() )

In [16]:
df['Age'].isnull().sum()

0

In [17]:
df['Embarked'] = df['Embarked'].fillna('S')

In [18]:
df['Embarked'].isnull().sum()

0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Sex       891 non-null    object
 2   Age       891 non-null    float64
 3   Embarked  891 non-null    object
dtypes: float64(1), int64(1), object(2)
memory usage: 28.0+ KB

In [23]:
# Sex , Embarked encoding 
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()
df['Age'] = encoder.fit_transform(df['Age'])

In [24]:
df

     Survived     Sex  Age Embarked
0           0    male   28        S
1           1  female   52        C
2           1  female   34        S
3           1  female   48        S
4           0    male   48        S
..        ...     ...  ...      ...
886         0    male   35        S
887         1  female   24        S
888         0  female   39        S
889         1    male   34        C
890         0    male   43        Q

[891 rows x 4 columns]